sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_ICLR Bits */
/* MCAN_ICLR[INTL0] Bits */
#define MCAN_ICLR_INTL0_OFS                      (0)                             /* !< INTL0 Offset */
#define MCAN_ICLR_INTL0_MASK                     ((uint32_t)0x00000001U)         /* !< Clear MCAN Interrupt Line 0. */
#define MCAN_ICLR_INTL0_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ICLR_INTL0_CLR                      ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* MCAN_ICLR[INTL1] Bits */
#define MCAN_ICLR_INTL1_OFS                      (1)                             /* !< INTL1 Offset */
#define MCAN_ICLR_INTL1_MASK                     ((uint32_t)0x00000002U)         /* !< Clear MCAN Interrupt Line 1. */
#define MCAN_ICLR_INTL1_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ICLR_INTL1_CLR                      ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* MCAN_ICLR[SEC] Bits */
#define MCAN_ICLR_SEC_OFS                        (2)                             /* !< SEC Offset */
#define MCAN_ICLR_SEC_MASK                       ((uint32_t)0x00000004U)         /* !< Clear Message RAM SEC interrupt. */
#define MCAN_ICLR_SEC_NO_EFFECT                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ICLR_SEC_CLR                        ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* MCAN_ICLR[DED] Bits */
#define MCAN_ICLR_DED_OFS                        (3)                             /* !< DED Offset */
#define MCAN_ICLR_DED_MASK                       ((uint32_t)0x00000008U)         /* !< Clear Message RAM DED interrupt. */
#define MCAN_ICLR_DED_NO_EFFECT                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ICLR_DED_CLR                        ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* MCAN_ICLR[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_ICLR_EXT_TS_CNTR_OVFL_OFS           (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_ICLR_EXT_TS_CNTR_OVFL_MASK          ((uint32_t)0x00000010U)         /* !< Clear External Timestamp Counter
                                                                                    Overflow interrupt. */
#define MCAN_ICLR_EXT_TS_CNTR_OVFL_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ICLR_EXT_TS_CNTR_OVFL_CLR           ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* MCAN_ICLR[WAKEUP] Bits */
#define MCAN_ICLR_WAKEUP_OFS                     (5)                             /* !< WAKEUP Offset */
#define MCAN_ICLR_WAKEUP_MASK                    ((uint32_t)0x00000020U)         /* !< Clear Clock Stop Wake Up interrupt. */
#define MCAN_ICLR_WAKEUP_NO_EFFECT               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ICLR_WAKEUP_CLR                     ((uint32_t)0x00000020U)         /* !< Clear Interrupt */

/* MCAN_EVT_MODE Bits */
/* MCAN_EVT_MODE[INT0_CFG] Bits */
#define MCAN_EVT_MODE_INT0_CFG_OFS               (0)                             /* !< INT0_CFG Offset */
#define MCAN_EVT_MODE_INT0_CFG_MASK              ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT0] */
#define MCAN_EVT_MODE_INT0_CFG_DISABLE           ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define MCAN_EVT_MODE_INT0_CFG_SOFTWARE          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define MCAN_EVT_MODE_INT0_CFG_HARDWARE          ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* MCAN_DESC Bits */
/* MCAN_DESC[MINREV] Bits */
#define MCAN_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define MCAN_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define MCAN_DESC_MINREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define MCAN_DESC_MINREV_MAXIMUM                 ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* MCAN_DESC[MAJREV] Bits */
#define MCAN_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define MCAN_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define MCAN_DESC_MAJREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define MCAN_DESC_MAJREV_MAXIMUM                 ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* MCAN_DESC[FEATUREVER] Bits */
#define MCAN_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define MCAN_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define MCAN_DESC_FEATUREVER_VERSION_0           ((uint32_t)0x00000000U)         /* !< MCAN module with CAN-FD mode
                                                                                    enabled  <<Internal Note: This is an
                                                                                    in-IP paper spin variant. How does
                                                                                    this map to the SYS_MCAN_ENABLE_FD
                                                                                    choice value?>> */
#define MCAN_DESC_FEATUREVER_VERSION_1           ((uint32_t)0x00001000U)         /* !< MCAN module with CAN-FD mode
                                                                                    disabled  <<Internal Note: This is an
                                                                                    in-IP paper spin variant. How does
                                                                                    this map to the SYS_MCAN_ENABLE_FD
                                                                                    choice value?>> */
/* MCAN_DESC[MODULEID] Bits */
#define MCAN_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define MCAN_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define MCAN_DESC_MODULEID_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define MCAN_DESC_MODULEID_MAXIMUM               ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* MCAN_CLKEN Bits */
/* MCAN_CLKEN[CLK_REQEN] Bits */
#define MCAN_CLKEN_CLK_REQEN_OFS                 (0)                             /* !< CLK_REQEN Offset */
#define MCAN_CLKEN_CLK_REQEN_MASK                ((uint32_t)0x00000001U)         /* !< MCAN functional and MCAN/MCANSS MMR
                                                                                    clock request enable bit */
#define MCAN_CLKEN_CLK_REQEN_CLR                 ((uint32_t)0x00000000U)         /* !< MCAN module functional clock and
                                                                                    Vbusp is not requested.  These clocks
                                                                                    are gated to the MCAN module. */
#define MCAN_CLKEN_CLK_REQEN_SET                 ((uint32_t)0x00000001U)         /* !< Setting this bit requests MCAN
                                                                                    module functional clock and Vbusp.
                                                                                    These clocks are not gated to MCAN
                                                                                    module. */

