sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_CLKDIV Bits */
/* MCAN_CLKDIV[RATIO] Bits */
#define MCAN_CLKDIV_RATIO_OFS                    (0)                             /* !< RATIO Offset */
#define MCAN_CLKDIV_RATIO_MASK                   ((uint32_t)0x00000003U)         /* !< Clock divide ratio specification.
                                                                                    Enables configuring clock divide
                                                                                    settings for the MCAN functional
                                                                                    clock input to the MCAN-SS. */
#define MCAN_CLKDIV_RATIO_DIV_BY_1_              ((uint32_t)0x00000000U)         /* !< Divides input clock by 1 */
#define MCAN_CLKDIV_RATIO_DIV_BY_2_              ((uint32_t)0x00000001U)         /* !< Divides input clock by 2 */
#define MCAN_CLKDIV_RATIO_DIV_BY_4_              ((uint32_t)0x00000002U)         /* !< Divides input clock by 4 */
#define MCAN_CLKDIV_RATIO_DIV_BY_1_1             ((uint32_t)0x00000003U)         /* !< Divides input clock by 1 */

/* MCAN_CLKCTL Bits */
/* MCAN_CLKCTL[STOPREQ] Bits */
#define MCAN_CLKCTL_STOPREQ_OFS                  (0)                             /* !< STOPREQ Offset */
#define MCAN_CLKCTL_STOPREQ_MASK                 ((uint32_t)0x00000001U)         /* !< This bit is used to enable/disable
                                                                                    MCAN clock (both host clock and
                                                                                    functional clock) gating request.
                                                                                    Note: This bit can be reset by HW by
                                                                                    Clock-Stop Wake-up via CAN RX
                                                                                    Activity. See spec for more details. */
#define MCAN_CLKCTL_STOPREQ_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable MCAN-SS clock stop request */
#define MCAN_CLKCTL_STOPREQ_ENABLE               ((uint32_t)0x00000001U)         /* !< Enable MCAN-SS clock stop request */
/* MCAN_CLKCTL[WAKEUP_INT_EN] Bits */
#define MCAN_CLKCTL_WAKEUP_INT_EN_OFS            (4)                             /* !< WAKEUP_INT_EN Offset */
#define MCAN_CLKCTL_WAKEUP_INT_EN_MASK           ((uint32_t)0x00000010U)         /* !< This bit contols enabling or
                                                                                    disabling the MCAN IP clock stop
                                                                                    wakeup interrupt (when
                                                                                    MCANSS_CTRL.WAKEUPREQEN wakeup
                                                                                    request is enabled to wakeup MCAN IP
                                                                                    upon CAN RXD activity) */
#define MCAN_CLKCTL_WAKEUP_INT_EN_DISABLE        ((uint32_t)0x00000000U)         /* !< Disable MCAN IP clock stop wakeup
                                                                                    interrupt */
#define MCAN_CLKCTL_WAKEUP_INT_EN_ENABLE         ((uint32_t)0x00000010U)         /* !< Enable MCAN IP clock stop wakeup
                                                                                    interrupt */
/* MCAN_CLKCTL[WKUP_GLTFLT_EN] Bits */
#define MCAN_CLKCTL_WKUP_GLTFLT_EN_OFS           (8)                             /* !< WKUP_GLTFLT_EN Offset */
#define MCAN_CLKCTL_WKUP_GLTFLT_EN_MASK          ((uint32_t)0x00000100U)         /* !< Setting this bit enables the glitch
                                                                                    filter on MCAN RXD input, which wakes
                                                                                    up the MCAN controller to exit clock
                                                                                    gating. */
#define MCAN_CLKCTL_WKUP_GLTFLT_EN_DISABLE       ((uint32_t)0x00000000U)         /* !< Disable glitch filter enable on RXD
                                                                                    input when MCAN is in clock stop mode
                                                                                    (waiting for event on RXD input for
                                                                                    clock stop wakeup). */
#define MCAN_CLKCTL_WKUP_GLTFLT_EN_ENABLE        ((uint32_t)0x00000100U)         /* !< Enable glitch filter enable on RXD
                                                                                    input when MCAN is in clock stop mode
                                                                                    (waiting for event on RXD input for
                                                                                    clock stop wakeup). */

/* MCAN_CLKSTS Bits */
/* MCAN_CLKSTS[CLKSTOP_ACKSTS] Bits */
#define MCAN_CLKSTS_CLKSTOP_ACKSTS_OFS           (0)                             /* !< CLKSTOP_ACKSTS Offset */
#define MCAN_CLKSTS_CLKSTOP_ACKSTS_MASK          ((uint32_t)0x00000001U)         /* !< Clock stop acknowledge status from
                                                                                    MCAN IP */
#define MCAN_CLKSTS_CLKSTOP_ACKSTS_RESET         ((uint32_t)0x00000000U)         /* !< No clock stop acknowledged. */
#define MCAN_CLKSTS_CLKSTOP_ACKSTS_SET           ((uint32_t)0x00000001U)         /* !< Clock stop has been acknowledged by
                                                                                    MCAN IP; MCAN-SS may be clock gated
                                                                                    by stopping both the CAN host and
                                                                                    functional clocks. */
/* MCAN_CLKSTS[STOPREQ_HW_OVR] Bits */
#define MCAN_CLKSTS_STOPREQ_HW_OVR_OFS           (4)                             /* !< STOPREQ_HW_OVR Offset */
#define MCAN_CLKSTS_STOPREQ_HW_OVR_MASK          ((uint32_t)0x00000010U)         /* !< MCANSS clock stop HW override
                                                                                    status bit.   This bit indicates when
                                                                                    the MCANSS_CLKCTL.STOPREQ bit has
                                                                                    been cleared by HW when a clock-stop
                                                                                    wake-up event via CAN RX activity is
                                                                                    triggered. */
#define MCAN_CLKSTS_STOPREQ_HW_OVR_RESET         ((uint32_t)0x00000000U)         /* !< MCANSS_CLKCTL.STOPREQ bit has not
                                                                                    been cleared by HW. */
#define MCAN_CLKSTS_STOPREQ_HW_OVR_SET           ((uint32_t)0x00000010U)         /* !< MCANSS_CLKCTL.STOPREQ bit has been
                                                                                    cleared by HW. */
/* MCAN_CLKSTS[CCLKDONE] Bits */
#define MCAN_CLKSTS_CCLKDONE_OFS                 (8)                             /* !< CCLKDONE Offset */
#define MCAN_CLKSTS_CCLKDONE_MASK                ((uint32_t)0x00000100U)         /* !< This bit indicates the status of
                                                                                    MCAN contoller clock request from
                                                                                    GPRCM. */
#define MCAN_CLKSTS_CCLKDONE_RESET               ((uint32_t)0x00000000U)         /* !< MCAN controller clock is not
                                                                                    available to the MCAN IP. */
#define MCAN_CLKSTS_CCLKDONE_SET                 ((uint32_t)0x00000100U)         /* !< MCAN controller clock is enabled
                                                                                    and available to the MCAN IP. */

/* MCAN_REV Bits */
/* MCAN_REV[REVMIN] Bits */
#define MCAN_REV_REVMIN_OFS                      (0)                             /* !< REVMIN Offset */
#define MCAN_REV_REVMIN_MASK                     ((uint32_t)0x0000003FU)         /* !< Minor Revision of the Error
                                                                                    Aggregator */
/* MCAN_REV[REVMAJ] Bits */
#define MCAN_REV_REVMAJ_OFS                      (8)                             /* !< REVMAJ Offset */
#define MCAN_REV_REVMAJ_MASK                     ((uint32_t)0x00000700U)         /* !< Major Revision of the Error
                                                                                    Aggregator */
/* MCAN_REV[MODULE_ID] Bits */
#define MCAN_REV_MODULE_ID_OFS                   (16)                            /* !< MODULE_ID Offset */
#define MCAN_REV_MODULE_ID_MASK                  ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* MCAN_REV[SCHEME] Bits */
#define MCAN_REV_SCHEME_OFS                      (30)                            /* !< SCHEME Offset */
#define MCAN_REV_SCHEME_MASK                     ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

/* MCAN_VECTOR Bits */
/* MCAN_VECTOR[ECC_VECTOR] Bits */
#define MCAN_VECTOR_ECC_VECTOR_OFS               (0)                             /* !< ECC_VECTOR Offset */
#define MCAN_VECTOR_ECC_VECTOR_MASK              ((uint32_t)0x000007FFU)         /* !< ECC RAM ID. Each error detection
                                                                                    and correction (EDC) controller has a
                                                                                    bank of error registers (offsets 0x10
                                                                                    - 0x3B) associated with it. These
                                                                                    registers are accessed via an
                                                                                    internal serial bus (SVBUS). To
                                                                                    access them through the ECC
                                                                                    aggregator the controller ID desired
                                                                                    must be written to the ECC_VECTOR
                                                                                    field, together with the RD_SVBUS
                                                                                    trigger and RD_SVBUS_ADDRESS bit
                                                                                    field. This initiates the serial read
                                                                                    which consummates by setting the
                                                                                    RD_SVBUS_DONE bit. At this point the
                                                                                    addressed register may be read by a
                                                                                    normal CPU read of the appropriate
                                                                                    offset address.   0x000  Message RAM
                                                                                    ECC controller is selected   Others
                                                                                    Reserved (do not use)   Subsequent
                                                                                    writes through the SVBUS (offsets
                                                                                    0x10 - 0x3B) have a delayed
                                                                                    completion. To avoid conflicts,
                                                                                    perform a read back of a register
                                                                                    within this range after writing. */
/* MCAN_VECTOR[RD_SVBUS] Bits */
#define MCAN_VECTOR_RD_SVBUS_OFS                 (15)                            /* !< RD_SVBUS Offset */
#define MCAN_VECTOR_RD_SVBUS_MASK                ((uint32_t)0x00008000U)         /* !< Read Trigger */
/* MCAN_VECTOR[RD_SVBUS_ADDRESS] Bits */
#define MCAN_VECTOR_RD_SVBUS_ADDRESS_OFS         (16)                            /* !< RD_SVBUS_ADDRESS Offset */
#define MCAN_VECTOR_RD_SVBUS_ADDRESS_MASK        ((uint32_t)0x00FF0000U)         /* !< Read Address Offset */
/* MCAN_VECTOR[RD_SVBUS_DONE] Bits */
#define MCAN_VECTOR_RD_SVBUS_DONE_OFS            (24)                            /* !< RD_SVBUS_DONE Offset */
#define MCAN_VECTOR_RD_SVBUS_DONE_MASK           ((uint32_t)0x01000000U)         /* !< Read Completion Flag */

/* MCAN_TI_WRAPPER_PROCESSORS_ECC_REGS_STAT Bits */
/* MCAN_TI_WRAPPER_PROCESSORS_ECC_REGS_STAT[NUM_RAMS] Bits */
#define MCAN_TI_WRAPPER_PROCESSORS_ECC_REGS_STAT_NUM_RAMS_OFS (0)                             /* !< NUM_RAMS Offset */
#define MCAN_TI_WRAPPER_PROCESSORS_ECC_REGS_STAT_NUM_RAMS_MASK ((uint32_t)0x000007FFU)         /* !< Number of RAMs. Number of ECC RAMs
                                                                                    serviced by the aggregator. */

