sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_WRAP_REV Bits */
/* MCAN_WRAP_REV[REVMIN] Bits */
#define MCAN_WRAP_REV_REVMIN_OFS                 (0)                             /* !< REVMIN Offset */
#define MCAN_WRAP_REV_REVMIN_MASK                ((uint32_t)0x0000003FU)         /* !< Minor Revision of the Error
                                                                                    Aggregator */
/* MCAN_WRAP_REV[REVMAJ] Bits */
#define MCAN_WRAP_REV_REVMAJ_OFS                 (8)                             /* !< REVMAJ Offset */
#define MCAN_WRAP_REV_REVMAJ_MASK                ((uint32_t)0x00000700U)         /* !< Major Revision of the Error
                                                                                    Aggregator */
/* MCAN_WRAP_REV[MODULE_ID] Bits */
#define MCAN_WRAP_REV_MODULE_ID_OFS              (16)                            /* !< MODULE_ID Offset */
#define MCAN_WRAP_REV_MODULE_ID_MASK             ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* MCAN_WRAP_REV[SCHEME] Bits */
#define MCAN_WRAP_REV_SCHEME_OFS                 (30)                            /* !< SCHEME Offset */
#define MCAN_WRAP_REV_SCHEME_MASK                ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

/* MCAN_TI_WRAPPER_ECC_REGS_CTRL Bits */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[ECC_ENABLE] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ECC_ENABLE_OFS (0)                             /* !< ECC_ENABLE Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ECC_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Enable ECC Generation */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[ECC_CHECK] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ECC_CHECK_OFS (1)                             /* !< ECC_CHECK Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ECC_CHECK_MASK ((uint32_t)0x00000002U)         /* !< Enable ECC Check. ECC is completely
                                                                                    bypassed if both ECC_ENABLE and
                                                                                    ECC_CHECK are '0'. */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[ENABLE_RMW] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ENABLE_RMW_OFS (2)                             /* !< ENABLE_RMW Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ENABLE_RMW_MASK ((uint32_t)0x00000004U)         /* !< Enable read-modify-write on partial
                                                                                    word writes */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[FORCE_SEC] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_FORCE_SEC_OFS (3)                             /* !< FORCE_SEC Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_FORCE_SEC_MASK ((uint32_t)0x00000008U)         /* !< Force single-bit error. Cleared on
                                                                                    a writeback or the cycle following
                                                                                    the error if ERROR_ONCE is asserted.
                                                                                    For write through mode, this applies
                                                                                    to writes as well as reads.
                                                                                    MCANERR_ERR_CTRL1 and
                                                                                    MCANERR_ERR_CTRL2 should be
                                                                                    configured prior to setting this bit. */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[FORCE_DED] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_FORCE_DED_OFS (4)                             /* !< FORCE_DED Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_FORCE_DED_MASK ((uint32_t)0x00000010U)         /* !< Force double-bit error. Cleared the
                                                                                    cycle following the error if
                                                                                    ERROR_ONCE is asserted. For write
                                                                                    through mode, this applies to writes
                                                                                    as well as reads. MCANERR_ERR_CTRL1
                                                                                    and MCANERR_ERR_CTRL2 should be
                                                                                    configured prior to setting this bit. */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[FORCE_N_ROW] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_FORCE_N_ROW_OFS (5)                             /* !< FORCE_N_ROW Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_FORCE_N_ROW_MASK ((uint32_t)0x00000020U)         /* !< Enable single/double-bit error on
                                                                                    the next RAM read, regardless of the
                                                                                    MCANERR_ERR_CTRL1.ECC_ROW setting.
                                                                                    For write through mode, this applies
                                                                                    to writes as well as reads. */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[ERROR_ONCE] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ERROR_ONCE_OFS (6)                             /* !< ERROR_ONCE Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_ERROR_ONCE_MASK ((uint32_t)0x00000040U)         /* !< If this bit is set, the
                                                                                    FORCE_SEC/FORCE_DED will inject an
                                                                                    error to the specified row only once.
                                                                                    The FORCE_SEC bit will be cleared
                                                                                    once a writeback happens. If
                                                                                    writeback is not enabled, this error
                                                                                    will be cleared the cycle following
                                                                                    the read when the data is corrected.
                                                                                    For double-bit errors, the FORCE_DED
                                                                                    bit will be cleared the cycle
                                                                                    following the double-bit error. Any
                                                                                    subsequent reads will not force an
                                                                                    error. */
/* MCAN_TI_WRAPPER_ECC_REGS_CTRL[CHECK_SVBUS_TIMEOUT] Bits */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_CHECK_SVBUS_TIMEOUT_OFS (8)                             /* !< CHECK_SVBUS_TIMEOUT Offset */
#define MCAN_TI_WRAPPER_ECC_REGS_CTRL_CHECK_SVBUS_TIMEOUT_MASK ((uint32_t)0x00000100U)         /* !< Enables Serial VBUS timeout
                                                                                    mechanism */

/* MCAN_ERR_CTRL1 Bits */
/* MCAN_ERR_CTRL1[ECC_ROW] Bits */
#define MCAN_ERR_CTRL1_ECC_ROW_OFS               (0)                             /* !< ECC_ROW Offset */
#define MCAN_ERR_CTRL1_ECC_ROW_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Row address where FORCE_SEC or
                                                                                    FORCE_DED needs to be applied. This
                                                                                    is ignored if FORCE_N_ROW is set. */

/* MCAN_ERR_CTRL2 Bits */
/* MCAN_ERR_CTRL2[ECC_BIT1] Bits */
#define MCAN_ERR_CTRL2_ECC_BIT1_OFS              (0)                             /* !< ECC_BIT1 Offset */
#define MCAN_ERR_CTRL2_ECC_BIT1_MASK             ((uint32_t)0x0000FFFFU)         /* !< Column/Data bit that needs to be
                                                                                    flipped when FORCE_SEC or FORCE_DED
                                                                                    is set */
/* MCAN_ERR_CTRL2[ECC_BIT2] Bits */
#define MCAN_ERR_CTRL2_ECC_BIT2_OFS              (16)                            /* !< ECC_BIT2 Offset */
#define MCAN_ERR_CTRL2_ECC_BIT2_MASK             ((uint32_t)0xFFFF0000U)         /* !< Second column/data bit that needs
                                                                                    to be flipped when FORCE_DED is set */

/* MCAN_ERR_STAT1 Bits */
/* MCAN_ERR_STAT1[ECC_SEC] Bits */
#define MCAN_ERR_STAT1_ECC_SEC_OFS               (0)                             /* !< ECC_SEC Offset */
#define MCAN_ERR_STAT1_ECC_SEC_MASK              ((uint32_t)0x00000003U)         /* !< Single Bit Error Corrected Status.
                                                                                    A 2-bit saturating counter of the
                                                                                    number of SEC errors that have
                                                                                    occurred since last cleared.     0
                                                                                    No single-bit error detected   1  One
                                                                                    single-bit error was detected and
                                                                                    corrected   2  Two single-bit errors
                                                                                    were detected and corrected   3
                                                                                    Three single-bit errors were detected
                                                                                    and corrected   A write of a non-zero
                                                                                    value to this bit field increments it
                                                                                    by the value provided. */
/* MCAN_ERR_STAT1[ECC_DED] Bits */
#define MCAN_ERR_STAT1_ECC_DED_OFS               (2)                             /* !< ECC_DED Offset */
#define MCAN_ERR_STAT1_ECC_DED_MASK              ((uint32_t)0x0000000CU)         /* !< Double Bit Error Detected Status. A
                                                                                    2-bit saturating counter of the
                                                                                    number of DED errors that have
                                                                                    occurred since last cleared.     0
                                                                                    No double-bit error detected   1  One
                                                                                    double-bit error was detected   2
                                                                                    Two double-bit errors were detected
                                                                                    3  Three double-bit errors were
                                                                                    detected   A write of a non-zero
                                                                                    value to this bit field increments it
                                                                                    by the value provided. */
/* MCAN_ERR_STAT1[ECC_OTHER] Bits */
#define MCAN_ERR_STAT1_ECC_OTHER_OFS             (4)                             /* !< ECC_OTHER Offset */
#define MCAN_ERR_STAT1_ECC_OTHER_MASK            ((uint32_t)0x00000010U)         /* !< SEC While Writeback Error Status
                                                                                    0  No SEC error while writeback
                                                                                    pending   1  Indicates that
                                                                                    successive single-bit errors have
                                                                                    occurred while a writeback is still
                                                                                    pending */
/* MCAN_ERR_STAT1[CTRL_REG_ERROR] Bits */
#define MCAN_ERR_STAT1_CTRL_REG_ERROR_OFS        (7)                             /* !< CTRL_REG_ERROR Offset */
#define MCAN_ERR_STAT1_CTRL_REG_ERROR_MASK       ((uint32_t)0x00000080U)         /* !< Control Register Error. A bit field
                                                                                    in the control register is in an
                                                                                    ambiguous state. This means that the
                                                                                    redundancy registers have detected a
                                                                                    state where not all values are the
                                                                                    same and has defaulted to the reset
                                                                                    state. S/W needs to re-write these
                                                                                    registers to a known state. A write
                                                                                    of 1 will set this interrupt flag. */
/* MCAN_ERR_STAT1[CLR_ECC_SEC] Bits */
#define MCAN_ERR_STAT1_CLR_ECC_SEC_OFS           (8)                             /* !< CLR_ECC_SEC Offset */
#define MCAN_ERR_STAT1_CLR_ECC_SEC_MASK          ((uint32_t)0x00000300U)         /* !< Clear ECC_SEC. A write of a
                                                                                    non-zero value to this bit field
                                                                                    decrements the ECC_SEC bit field by
                                                                                    the value provided. */
/* MCAN_ERR_STAT1[CLR_ECC_DED] Bits */
#define MCAN_ERR_STAT1_CLR_ECC_DED_OFS           (10)                            /* !< CLR_ECC_DED Offset */
#define MCAN_ERR_STAT1_CLR_ECC_DED_MASK          ((uint32_t)0x00000C00U)         /* !< Clear ECC_DED. A write of a
                                                                                    non-zero value to this bit field
                                                                                    decrements the ECC_DED bit field by
                                                                                    the value provided. */
/* MCAN_ERR_STAT1[CLR_ECC_OTHER] Bits */
#define MCAN_ERR_STAT1_CLR_ECC_OTHER_OFS         (12)                            /* !< CLR_ECC_OTHER Offset */
#define MCAN_ERR_STAT1_CLR_ECC_OTHER_MASK        ((uint32_t)0x00001000U)         /* !< Writing a '1' clears the ECC_OTHER
                                                                                    bit. */
/* MCAN_ERR_STAT1[CLR_CTRL_REG_ERROR] Bits */
#define MCAN_ERR_STAT1_CLR_CTRL_REG_ERROR_OFS    (15)                            /* !< CLR_CTRL_REG_ERROR Offset */
#define MCAN_ERR_STAT1_CLR_CTRL_REG_ERROR_MASK   ((uint32_t)0x00008000U)         /* !< Writing a '1' clears the
                                                                                    CTRL_REG_ERROR bit */
/* MCAN_ERR_STAT1[ECC_BIT1] Bits */
#define MCAN_ERR_STAT1_ECC_BIT1_OFS              (16)                            /* !< ECC_BIT1 Offset */
#define MCAN_ERR_STAT1_ECC_BIT1_MASK             ((uint32_t)0xFFFF0000U)         /* !< ECC Error Bit Position. Indicates
                                                                                    the bit position in the RAM data that
                                                                                    is in error on an SEC error. Only
                                                                                    valid on an SEC error.   0  Bit 0 is
                                                                                    in error   1  Bit 1 is in error   2
                                                                                    Bit 2 is in error   3  Bit 3 is in
                                                                                    error   ...   31 Bit 31 is in error
                                                                                    >32 Invalid */

/* MCAN_ERR_STAT2 Bits */
/* MCAN_ERR_STAT2[ECC_ROW] Bits */
#define MCAN_ERR_STAT2_ECC_ROW_OFS               (0)                             /* !< ECC_ROW Offset */
#define MCAN_ERR_STAT2_ECC_ROW_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Indicates the row address where the
                                                                                    single or double-bit error occurred.
                                                                                    This value is address offset/4. */

/* MCAN_ERR_STAT3 Bits */
/* MCAN_ERR_STAT3[WB_PEND] Bits */
#define MCAN_ERR_STAT3_WB_PEND_OFS               (0)                             /* !< WB_PEND Offset */
#define MCAN_ERR_STAT3_WB_PEND_MASK              ((uint32_t)0x00000001U)         /* !< Delayed Write Back Pending Status
                                                                                    0  No write back pending   1  An ECC
                                                                                    data correction write back is pending */
/* MCAN_ERR_STAT3[SVBUS_TIMEOUT] Bits */
#define MCAN_ERR_STAT3_SVBUS_TIMEOUT_OFS         (1)                             /* !< SVBUS_TIMEOUT Offset */
#define MCAN_ERR_STAT3_SVBUS_TIMEOUT_MASK        ((uint32_t)0x00000002U)         /* !< Serial VBUS Timeout Flag. Write 1
                                                                                    to set. */
/* MCAN_ERR_STAT3[CLR_SVBUS_TIMEOUT] Bits */
#define MCAN_ERR_STAT3_CLR_SVBUS_TIMEOUT_OFS     (9)                             /* !< CLR_SVBUS_TIMEOUT Offset */
#define MCAN_ERR_STAT3_CLR_SVBUS_TIMEOUT_MASK    ((uint32_t)0x00000200U)         /* !< Write 1 to clear the Serial VBUS
                                                                                    Timeout Flag */

/* MCAN_SEC_EOI Bits */
/* MCAN_SEC_EOI[EOI_WR] Bits */
#define MCAN_SEC_EOI_EOI_WR_OFS                  (0)                             /* !< EOI_WR Offset */
#define MCAN_SEC_EOI_EOI_WR_MASK                 ((uint32_t)0x00000001U)         /* !< Write to this register indicates
                                                                                    that software has acknowledged the
                                                                                    pending interrupt and the next
                                                                                    interrupt can be sent to the host.
                                                                                    Note that a write to the
                                                                                    MCANERR_ERR_STAT1.CLR_ECC_SEC goes
                                                                                    through the SVBUS and has a delayed
                                                                                    completion. To avoid an additional
                                                                                    interrupt, read the MCANERR_ERR_STAT1
                                                                                    register back prior to writing to
                                                                                    this bit field. */

/* MCAN_SEC_STATUS Bits */
/* MCAN_SEC_STATUS[MSGMEM_PEND] Bits */
#define MCAN_SEC_STATUS_MSGMEM_PEND_OFS          (0)                             /* !< MSGMEM_PEND Offset */
#define MCAN_SEC_STATUS_MSGMEM_PEND_MASK         ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    0  No SEC interrupt is pending   1
                                                                                    SEC interrupt is pending */

/* MCAN_SEC_ENABLE_SET Bits */
/* MCAN_SEC_ENABLE_SET[MSGMEM_ENABLE_SET] Bits */
#define MCAN_SEC_ENABLE_SET_MSGMEM_ENABLE_SET_OFS (0)                             /* !< MSGMEM_ENABLE_SET Offset */
#define MCAN_SEC_ENABLE_SET_MSGMEM_ENABLE_SET_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    Enable Set. Writing a 1 to this bit
                                                                                    enables the Message RAM SEC error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

