sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TSCV Bits */
/* MCAN_TSCV[TSC] Bits */
#define MCAN_TSCV_TSC_OFS                        (0)                             /* !< TSC Offset */
#define MCAN_TSCV_TSC_MASK                       ((uint32_t)0x0000FFFFU)         /* !< Timestamp Counter. The
                                                                                    internal/external Timestamp Counter
                                                                                    value is captured on start of frame
                                                                                    (both Rx and Tx). When TSCC.TSS =
                                                                                    "01", the Timestamp Counter is
                                                                                    incremented in multiples of CAN bit
                                                                                    times, (1...16), depending on the
                                                                                    configuration of TSCC.TCP. A wrap
                                                                                    around sets interrupt flag IR.TSW.
                                                                                    Write access resets the counter to
                                                                                    zero. When TSCC.TSS = "10", TSC
                                                                                    reflects the External Timestamp
                                                                                    Counter value, and a write access has
                                                                                    no impact.   Note: A "wrap around" is
                                                                                    a change of the Timestamp Counter
                                                                                    value from non-zero to zero not
                                                                                    caused by write access to MCAN_TSCV. */

/* MCAN_TOCC Bits */
/* MCAN_TOCC[ETOC] Bits */
#define MCAN_TOCC_ETOC_OFS                       (0)                             /* !< ETOC Offset */
#define MCAN_TOCC_ETOC_MASK                      ((uint32_t)0x00000001U)         /* !< Enable Timeout Counter   0  Timeout
                                                                                    Counter disabled   1  Timeout Counter
                                                                                    enabled   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_TOCC[TOS] Bits */
#define MCAN_TOCC_TOS_OFS                        (1)                             /* !< TOS Offset */
#define MCAN_TOCC_TOS_MASK                       ((uint32_t)0x00000006U)         /* !< Timeout Select. When operating in
                                                                                    Continuous mode, a write to TOCV
                                                                                    presets the counter to the value
                                                                                    configured by TOCC.TOP and continues
                                                                                    down-counting. When the Timeout
                                                                                    Counter is controlled by one of the
                                                                                    FIFOs, an empty FIFO presets the
                                                                                    counter to the value configured by
                                                                                    TOCC.TOP. Down-counting is started
                                                                                    when the first FIFO element is
                                                                                    stored.   00  Continuous operation
                                                                                    01  Timeout controlled by Tx Event
                                                                                    FIFO   10  Timeout controlled by Rx
                                                                                    FIFO 0   11  Timeout controlled by Rx
                                                                                    FIFO 1   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_TOCC[TOP] Bits */
#define MCAN_TOCC_TOP_OFS                        (16)                            /* !< TOP Offset */
#define MCAN_TOCC_TOP_MASK                       ((uint32_t)0xFFFF0000U)         /* !< Timeout Period. Start value of the
                                                                                    Timeout Counter (down-counter).
                                                                                    Configures the Timeout Period.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

/* MCAN_TOCV Bits */
/* MCAN_TOCV[TOC] Bits */
#define MCAN_TOCV_TOC_OFS                        (0)                             /* !< TOC Offset */
#define MCAN_TOCV_TOC_MASK                       ((uint32_t)0x0000FFFFU)         /* !< Timeout Counter. The Timeout
                                                                                    Counter is decremented in multiples
                                                                                    of CAN bit times, (1...16), depending
                                                                                    on the configuration of TSCC.TCP.
                                                                                    When decremented to zero, interrupt
                                                                                    flag IR.TOO is set and the Timeout
                                                                                    Counter is stopped. Start and
                                                                                    reset/restart conditions are
                                                                                    configured via TOCC.TOS. */

