sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_ILS Bits */
/* MCAN_ILS[RF0NL] Bits */
#define MCAN_ILS_RF0NL_OFS                       (0)                             /* !< RF0NL Offset */
#define MCAN_ILS_RF0NL_MASK                      ((uint32_t)0x00000001U)         /* !< Rx FIFO 0 New Message Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[RF0WL] Bits */
#define MCAN_ILS_RF0WL_OFS                       (1)                             /* !< RF0WL Offset */
#define MCAN_ILS_RF0WL_MASK                      ((uint32_t)0x00000002U)         /* !< Rx FIFO 0 Watermark Reached Line
                                                                                    0  Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[RF0FL] Bits */
#define MCAN_ILS_RF0FL_OFS                       (2)                             /* !< RF0FL Offset */
#define MCAN_ILS_RF0FL_MASK                      ((uint32_t)0x00000004U)         /* !< Rx FIFO 0 Full Line   0  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    0   1  Interrupt source is assigned
                                                                                    to Interrupt Line 1 */
/* MCAN_ILS[RF0LL] Bits */
#define MCAN_ILS_RF0LL_OFS                       (3)                             /* !< RF0LL Offset */
#define MCAN_ILS_RF0LL_MASK                      ((uint32_t)0x00000008U)         /* !< Rx FIFO 0 Message Lost Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[RF1NL] Bits */
#define MCAN_ILS_RF1NL_OFS                       (4)                             /* !< RF1NL Offset */
#define MCAN_ILS_RF1NL_MASK                      ((uint32_t)0x00000010U)         /* !< Rx FIFO 1 New Message Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[RF1WL] Bits */
#define MCAN_ILS_RF1WL_OFS                       (5)                             /* !< RF1WL Offset */
#define MCAN_ILS_RF1WL_MASK                      ((uint32_t)0x00000020U)         /* !< Rx FIFO 1 Watermark Reached Line
                                                                                    0  Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[RF1FL] Bits */
#define MCAN_ILS_RF1FL_OFS                       (6)                             /* !< RF1FL Offset */
#define MCAN_ILS_RF1FL_MASK                      ((uint32_t)0x00000040U)         /* !< Rx FIFO 1 Full Line   0  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    0   1  Interrupt source is assigned
                                                                                    to Interrupt Line 1 */
/* MCAN_ILS[RF1LL] Bits */
#define MCAN_ILS_RF1LL_OFS                       (7)                             /* !< RF1LL Offset */
#define MCAN_ILS_RF1LL_MASK                      ((uint32_t)0x00000080U)         /* !< Rx FIFO 1 Message Lost Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[HPML] Bits */
#define MCAN_ILS_HPML_OFS                        (8)                             /* !< HPML Offset */
#define MCAN_ILS_HPML_MASK                       ((uint32_t)0x00000100U)         /* !< High Priority Message Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[TCL] Bits */
#define MCAN_ILS_TCL_OFS                         (9)                             /* !< TCL Offset */
#define MCAN_ILS_TCL_MASK                        ((uint32_t)0x00000200U)         /* !< Transmission Completed Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[TCFL] Bits */
#define MCAN_ILS_TCFL_OFS                        (10)                            /* !< TCFL Offset */
#define MCAN_ILS_TCFL_MASK                       ((uint32_t)0x00000400U)         /* !< Transmission Cancellation Finished
                                                                                    Line   0  Interrupt source is
                                                                                    assigned to Interrupt Line 0   1
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 1 */
/* MCAN_ILS[TFEL] Bits */
#define MCAN_ILS_TFEL_OFS                        (11)                            /* !< TFEL Offset */
#define MCAN_ILS_TFEL_MASK                       ((uint32_t)0x00000800U)         /* !< Tx FIFO Empty Line   0  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    0   1  Interrupt source is assigned
                                                                                    to Interrupt Line 1 */
/* MCAN_ILS[TEFNL] Bits */
#define MCAN_ILS_TEFNL_OFS                       (12)                            /* !< TEFNL Offset */
#define MCAN_ILS_TEFNL_MASK                      ((uint32_t)0x00001000U)         /* !< Tx Event FIFO New Entry Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[TEFWL] Bits */
#define MCAN_ILS_TEFWL_OFS                       (13)                            /* !< TEFWL Offset */
#define MCAN_ILS_TEFWL_MASK                      ((uint32_t)0x00002000U)         /* !< Tx Event FIFO Watermark Reached
                                                                                    Line   0  Interrupt source is
                                                                                    assigned to Interrupt Line 0   1
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 1 */
/* MCAN_ILS[TEFFL] Bits */
#define MCAN_ILS_TEFFL_OFS                       (14)                            /* !< TEFFL Offset */
#define MCAN_ILS_TEFFL_MASK                      ((uint32_t)0x00004000U)         /* !< Tx Event FIFO Full Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[TEFLL] Bits */
#define MCAN_ILS_TEFLL_OFS                       (15)                            /* !< TEFLL Offset */
#define MCAN_ILS_TEFLL_MASK                      ((uint32_t)0x00008000U)         /* !< Tx Event FIFO Element Lost Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[TSWL] Bits */
#define MCAN_ILS_TSWL_OFS                        (16)                            /* !< TSWL Offset */
#define MCAN_ILS_TSWL_MASK                       ((uint32_t)0x00010000U)         /* !< Timestamp Wraparound Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[MRAFL] Bits */
#define MCAN_ILS_MRAFL_OFS                       (17)                            /* !< MRAFL Offset */
#define MCAN_ILS_MRAFL_MASK                      ((uint32_t)0x00020000U)         /* !< Message RAM Access Failure Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[TOOL] Bits */
#define MCAN_ILS_TOOL_OFS                        (18)                            /* !< TOOL Offset */
#define MCAN_ILS_TOOL_MASK                       ((uint32_t)0x00040000U)         /* !< Timeout Occurred Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[DRXL] Bits */
#define MCAN_ILS_DRXL_OFS                        (19)                            /* !< DRXL Offset */
#define MCAN_ILS_DRXL_MASK                       ((uint32_t)0x00080000U)         /* !< Message Stored to Dedicated Rx
                                                                                    Buffer Line   0  Interrupt source is
                                                                                    assigned to Interrupt Line 0   1
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 1 */
/* MCAN_ILS[BECL] Bits */
#define MCAN_ILS_BECL_OFS                        (20)                            /* !< BECL Offset */
#define MCAN_ILS_BECL_MASK                       ((uint32_t)0x00100000U)         /* !< Bit Error Corrected Line   A
                                                                                    separate interrupt line reserved for
                                                                                    corrected bit errors is provided via
                                                                                    the MCAN_ERROR_REGS. It advised for
                                                                                    the user to use these registers and
                                                                                    leave the MCAN_IE.BECE bit cleared to
                                                                                    '0' (disabled), thereby relegating
                                                                                    this bit to not applicable. */
/* MCAN_ILS[BEUL] Bits */
#define MCAN_ILS_BEUL_OFS                        (21)                            /* !< BEUL Offset */
#define MCAN_ILS_BEUL_MASK                       ((uint32_t)0x00200000U)         /* !< Bit Error Uncorrected Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[ELOL] Bits */
#define MCAN_ILS_ELOL_OFS                        (22)                            /* !< ELOL Offset */
#define MCAN_ILS_ELOL_MASK                       ((uint32_t)0x00400000U)         /* !< Error Logging Overflow Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[EPL] Bits */
#define MCAN_ILS_EPL_OFS                         (23)                            /* !< EPL Offset */
#define MCAN_ILS_EPL_MASK                        ((uint32_t)0x00800000U)         /* !< Error Passive Line   0  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    0   1  Interrupt source is assigned
                                                                                    to Interrupt Line 1 */
/* MCAN_ILS[EWL] Bits */
#define MCAN_ILS_EWL_OFS                         (24)                            /* !< EWL Offset */
#define MCAN_ILS_EWL_MASK                        ((uint32_t)0x01000000U)         /* !< Warning Status Line   0  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    0   1  Interrupt source is assigned
                                                                                    to Interrupt Line 1 */
/* MCAN_ILS[BOL] Bits */
#define MCAN_ILS_BOL_OFS                         (25)                            /* !< BOL Offset */
#define MCAN_ILS_BOL_MASK                        ((uint32_t)0x02000000U)         /* !< Bus_Off Status Line   0  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    0   1  Interrupt source is assigned
                                                                                    to Interrupt Line 1 */
/* MCAN_ILS[WDIL] Bits */
#define MCAN_ILS_WDIL_OFS                        (26)                            /* !< WDIL Offset */
#define MCAN_ILS_WDIL_MASK                       ((uint32_t)0x04000000U)         /* !< Watchdog Interrupt Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[PEAL] Bits */
#define MCAN_ILS_PEAL_OFS                        (27)                            /* !< PEAL Offset */
#define MCAN_ILS_PEAL_MASK                       ((uint32_t)0x08000000U)         /* !< Protocol Error in Arbitration Phase
                                                                                    Line   0  Interrupt source is
                                                                                    assigned to Interrupt Line 0   1
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 1 */
/* MCAN_ILS[PEDL] Bits */
#define MCAN_ILS_PEDL_OFS                        (28)                            /* !< PEDL Offset */
#define MCAN_ILS_PEDL_MASK                       ((uint32_t)0x10000000U)         /* !< Protocol Error in Data Phase Line
                                                                                    0  Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */
/* MCAN_ILS[ARAL] Bits */
#define MCAN_ILS_ARAL_OFS                        (29)                            /* !< ARAL Offset */
#define MCAN_ILS_ARAL_MASK                       ((uint32_t)0x20000000U)         /* !< Access to Reserved Address Line   0
                                                                                    Interrupt source is assigned to
                                                                                    Interrupt Line 0   1  Interrupt
                                                                                    source is assigned to Interrupt Line
                                                                                    1 */

/* MCAN_ILE Bits */
/* MCAN_ILE[EINT0] Bits */
#define MCAN_ILE_EINT0_OFS                       (0)                             /* !< EINT0 Offset */
#define MCAN_ILE_EINT0_MASK                      ((uint32_t)0x00000001U)         /* !< Enable Interrupt Line 0   0
                                                                                    Interrupt Line 0 is disabled   1
                                                                                    Interrupt Line 0 is enabled */
/* MCAN_ILE[EINT1] Bits */
#define MCAN_ILE_EINT1_OFS                       (1)                             /* !< EINT1 Offset */
#define MCAN_ILE_EINT1_MASK                      ((uint32_t)0x00000002U)         /* !< Enable Interrupt Line 1   0
                                                                                    Interrupt Line 1 is disabled   1
                                                                                    Interrupt Line 1 is enabled */

