sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_GFC Bits */
/* MCAN_GFC[RRFE] Bits */
#define MCAN_GFC_RRFE_OFS                        (0)                             /* !< RRFE Offset */
#define MCAN_GFC_RRFE_MASK                       ((uint32_t)0x00000001U)         /* !< Reject Remote Frames Extended   0
                                                                                    Filter remote frames with 29-bit
                                                                                    extended IDs   1  Reject all remote
                                                                                    frames with 29-bit extended IDs
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_GFC[RRFS] Bits */
#define MCAN_GFC_RRFS_OFS                        (1)                             /* !< RRFS Offset */
#define MCAN_GFC_RRFS_MASK                       ((uint32_t)0x00000002U)         /* !< Reject Remote Frames Standard   0
                                                                                    Filter remote frames with 11-bit
                                                                                    standard IDs   1  Reject all remote
                                                                                    frames with 11-bit standard IDs
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_GFC[ANFE] Bits */
#define MCAN_GFC_ANFE_OFS                        (2)                             /* !< ANFE Offset */
#define MCAN_GFC_ANFE_MASK                       ((uint32_t)0x0000000CU)         /* !< Accept Non-matching Frames
                                                                                    Extended. Defines how received
                                                                                    messages with 29-bit IDs that do not
                                                                                    match any element of the filter list
                                                                                    are treated.   00  Accept in Rx FIFO
                                                                                    0   01  Accept in Rx FIFO 1   10
                                                                                    Reject   11  Reject   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */
/* MCAN_GFC[ANFS] Bits */
#define MCAN_GFC_ANFS_OFS                        (4)                             /* !< ANFS Offset */
#define MCAN_GFC_ANFS_MASK                       ((uint32_t)0x00000030U)         /* !< Accept Non-matching Frames
                                                                                    Standard. Defines how received
                                                                                    messages with 11-bit IDs that do not
                                                                                    match any element of the filter list
                                                                                    are treated.   00  Accept in Rx FIFO
                                                                                    0   01  Accept in Rx FIFO 1   10
                                                                                    Reject   11  Reject   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */

/* MCAN_SIDFC Bits */
/* MCAN_SIDFC[FLSSA] Bits */
#define MCAN_SIDFC_FLSSA_OFS                     (2)                             /* !< FLSSA Offset */
#define MCAN_SIDFC_FLSSA_MASK                    ((uint32_t)0x0000FFFCU)         /* !< Filter List Standard Start Address.
                                                                                    Start address of standard Message ID
                                                                                    filter list (32-bit word address). */
/* MCAN_SIDFC[LSS] Bits */
#define MCAN_SIDFC_LSS_OFS                       (16)                            /* !< LSS Offset */
#define MCAN_SIDFC_LSS_MASK                      ((uint32_t)0x00FF0000U)         /* !< List Size Standard   0        No
                                                                                    standard Message ID filter   1-128
                                                                                    Number of standard Message ID filter
                                                                                    elements   >128   Values greater than
                                                                                    128 are interpreted as 128 */

/* MCAN_XIDFC Bits */
/* MCAN_XIDFC[FLESA] Bits */
#define MCAN_XIDFC_FLESA_OFS                     (2)                             /* !< FLESA Offset */
#define MCAN_XIDFC_FLESA_MASK                    ((uint32_t)0x0000FFFCU)         /* !< List Size Extended   0     No
                                                                                    extended Message ID filter   1-64
                                                                                    Number of extended Message ID filter
                                                                                    elements   >64  Values greater than
                                                                                    64 are interpreted as 64   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_XIDFC[LSE] Bits */
#define MCAN_XIDFC_LSE_OFS                       (16)                            /* !< LSE Offset */
#define MCAN_XIDFC_LSE_MASK                      ((uint32_t)0x007F0000U)         /* !< Filter List Extended Start Address.
                                                                                    Start address of extended Message ID
                                                                                    filter list (32-bit word address).
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

/* MCAN_XIDAM Bits */
/* MCAN_XIDAM[EIDM] Bits */
#define MCAN_XIDAM_EIDM_OFS                      (0)                             /* !< EIDM Offset */
#define MCAN_XIDAM_EIDM_MASK                     ((uint32_t)0x1FFFFFFFU)         /* !< Extended ID Mask. For acceptance
                                                                                    filtering of extended frames the
                                                                                    Extended ID AND Mask is ANDed with
                                                                                    the Message ID of a received frame.
                                                                                    Intended for masking of 29-bit IDs in
                                                                                    SAE J1939. With the reset value of
                                                                                    all bits set to one the mask is not
                                                                                    active.   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */

