sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_NDAT2 Bits */
/* MCAN_NDAT2[ND32] Bits */
#define MCAN_NDAT2_ND32_OFS                      (0)                             /* !< ND32 Offset */
#define MCAN_NDAT2_ND32_MASK                     ((uint32_t)0x00000001U)         /* !< New Data RX Buffer 32   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND33] Bits */
#define MCAN_NDAT2_ND33_OFS                      (1)                             /* !< ND33 Offset */
#define MCAN_NDAT2_ND33_MASK                     ((uint32_t)0x00000002U)         /* !< New Data RX Buffer 33   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND34] Bits */
#define MCAN_NDAT2_ND34_OFS                      (2)                             /* !< ND34 Offset */
#define MCAN_NDAT2_ND34_MASK                     ((uint32_t)0x00000004U)         /* !< New Data RX Buffer 34   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND35] Bits */
#define MCAN_NDAT2_ND35_OFS                      (3)                             /* !< ND35 Offset */
#define MCAN_NDAT2_ND35_MASK                     ((uint32_t)0x00000008U)         /* !< New Data RX Buffer 35   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND36] Bits */
#define MCAN_NDAT2_ND36_OFS                      (4)                             /* !< ND36 Offset */
#define MCAN_NDAT2_ND36_MASK                     ((uint32_t)0x00000010U)         /* !< New Data RX Buffer 36   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND37] Bits */
#define MCAN_NDAT2_ND37_OFS                      (5)                             /* !< ND37 Offset */
#define MCAN_NDAT2_ND37_MASK                     ((uint32_t)0x00000020U)         /* !< New Data RX Buffer 37   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND38] Bits */
#define MCAN_NDAT2_ND38_OFS                      (6)                             /* !< ND38 Offset */
#define MCAN_NDAT2_ND38_MASK                     ((uint32_t)0x00000040U)         /* !< New Data RX Buffer 38   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND39] Bits */
#define MCAN_NDAT2_ND39_OFS                      (7)                             /* !< ND39 Offset */
#define MCAN_NDAT2_ND39_MASK                     ((uint32_t)0x00000080U)         /* !< New Data RX Buffer 39   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND40] Bits */
#define MCAN_NDAT2_ND40_OFS                      (8)                             /* !< ND40 Offset */
#define MCAN_NDAT2_ND40_MASK                     ((uint32_t)0x00000100U)         /* !< New Data RX Buffer 40   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND41] Bits */
#define MCAN_NDAT2_ND41_OFS                      (9)                             /* !< ND41 Offset */
#define MCAN_NDAT2_ND41_MASK                     ((uint32_t)0x00000200U)         /* !< New Data RX Buffer 41   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND42] Bits */
#define MCAN_NDAT2_ND42_OFS                      (10)                            /* !< ND42 Offset */
#define MCAN_NDAT2_ND42_MASK                     ((uint32_t)0x00000400U)         /* !< New Data RX Buffer 42   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND43] Bits */
#define MCAN_NDAT2_ND43_OFS                      (11)                            /* !< ND43 Offset */
#define MCAN_NDAT2_ND43_MASK                     ((uint32_t)0x00000800U)         /* !< New Data RX Buffer 43   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND44] Bits */
#define MCAN_NDAT2_ND44_OFS                      (12)                            /* !< ND44 Offset */
#define MCAN_NDAT2_ND44_MASK                     ((uint32_t)0x00001000U)         /* !< New Data RX Buffer 44   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND45] Bits */
#define MCAN_NDAT2_ND45_OFS                      (13)                            /* !< ND45 Offset */
#define MCAN_NDAT2_ND45_MASK                     ((uint32_t)0x00002000U)         /* !< New Data RX Buffer 45   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND46] Bits */
#define MCAN_NDAT2_ND46_OFS                      (14)                            /* !< ND46 Offset */
#define MCAN_NDAT2_ND46_MASK                     ((uint32_t)0x00004000U)         /* !< New Data RX Buffer 46   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND47] Bits */
#define MCAN_NDAT2_ND47_OFS                      (15)                            /* !< ND47 Offset */
#define MCAN_NDAT2_ND47_MASK                     ((uint32_t)0x00008000U)         /* !< New Data RX Buffer 47   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND48] Bits */
#define MCAN_NDAT2_ND48_OFS                      (16)                            /* !< ND48 Offset */
#define MCAN_NDAT2_ND48_MASK                     ((uint32_t)0x00010000U)         /* !< New Data RX Buffer 48   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND49] Bits */
#define MCAN_NDAT2_ND49_OFS                      (17)                            /* !< ND49 Offset */
#define MCAN_NDAT2_ND49_MASK                     ((uint32_t)0x00020000U)         /* !< New Data RX Buffer 49   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND50] Bits */
#define MCAN_NDAT2_ND50_OFS                      (18)                            /* !< ND50 Offset */
#define MCAN_NDAT2_ND50_MASK                     ((uint32_t)0x00040000U)         /* !< New Data RX Buffer 50   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND51] Bits */
#define MCAN_NDAT2_ND51_OFS                      (19)                            /* !< ND51 Offset */
#define MCAN_NDAT2_ND51_MASK                     ((uint32_t)0x00080000U)         /* !< New Data RX Buffer 51   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND52] Bits */
#define MCAN_NDAT2_ND52_OFS                      (20)                            /* !< ND52 Offset */
#define MCAN_NDAT2_ND52_MASK                     ((uint32_t)0x00100000U)         /* !< New Data RX Buffer 52   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND53] Bits */
#define MCAN_NDAT2_ND53_OFS                      (21)                            /* !< ND53 Offset */
#define MCAN_NDAT2_ND53_MASK                     ((uint32_t)0x00200000U)         /* !< New Data RX Buffer 53   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND54] Bits */
#define MCAN_NDAT2_ND54_OFS                      (22)                            /* !< ND54 Offset */
#define MCAN_NDAT2_ND54_MASK                     ((uint32_t)0x00400000U)         /* !< New Data RX Buffer 54   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND55] Bits */
#define MCAN_NDAT2_ND55_OFS                      (23)                            /* !< ND55 Offset */
#define MCAN_NDAT2_ND55_MASK                     ((uint32_t)0x00800000U)         /* !< New Data RX Buffer 55   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND56] Bits */
#define MCAN_NDAT2_ND56_OFS                      (24)                            /* !< ND56 Offset */
#define MCAN_NDAT2_ND56_MASK                     ((uint32_t)0x01000000U)         /* !< New Data RX Buffer 56   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND57] Bits */
#define MCAN_NDAT2_ND57_OFS                      (25)                            /* !< ND57 Offset */
#define MCAN_NDAT2_ND57_MASK                     ((uint32_t)0x02000000U)         /* !< New Data RX Buffer 57   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND58] Bits */
#define MCAN_NDAT2_ND58_OFS                      (26)                            /* !< ND58 Offset */
#define MCAN_NDAT2_ND58_MASK                     ((uint32_t)0x04000000U)         /* !< New Data RX Buffer 58   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND59] Bits */
#define MCAN_NDAT2_ND59_OFS                      (27)                            /* !< ND59 Offset */
#define MCAN_NDAT2_ND59_MASK                     ((uint32_t)0x08000000U)         /* !< New Data RX Buffer 59   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND60] Bits */
#define MCAN_NDAT2_ND60_OFS                      (28)                            /* !< ND60 Offset */
#define MCAN_NDAT2_ND60_MASK                     ((uint32_t)0x10000000U)         /* !< New Data RX Buffer 60   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND61] Bits */
#define MCAN_NDAT2_ND61_OFS                      (29)                            /* !< ND61 Offset */
#define MCAN_NDAT2_ND61_MASK                     ((uint32_t)0x20000000U)         /* !< New Data RX Buffer 61   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND62] Bits */
#define MCAN_NDAT2_ND62_OFS                      (30)                            /* !< ND62 Offset */
#define MCAN_NDAT2_ND62_MASK                     ((uint32_t)0x40000000U)         /* !< New Data RX Buffer 62   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */
/* MCAN_NDAT2[ND63] Bits */
#define MCAN_NDAT2_ND63_OFS                      (31)                            /* !< ND63 Offset */
#define MCAN_NDAT2_ND63_MASK                     ((uint32_t)0x80000000U)         /* !< New Data RX Buffer 63   0  Rx
                                                                                    Buffer not updated   1  Rx Buffer
                                                                                    updated from new message */

/* MCAN_RXF0C Bits */
/* MCAN_RXF0C[F0SA] Bits */
#define MCAN_RXF0C_F0SA_OFS                      (2)                             /* !< F0SA Offset */
#define MCAN_RXF0C_F0SA_MASK                     ((uint32_t)0x0000FFFCU)         /* !< Rx FIFO 0 Start Address. Start
                                                                                    address of Rx FIFO 0 in Message RAM
                                                                                    (32-bit word address).   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_RXF0C[F0S] Bits */
#define MCAN_RXF0C_F0S_OFS                       (16)                            /* !< F0S Offset */
#define MCAN_RXF0C_F0S_MASK                      ((uint32_t)0x007F0000U)         /* !< Rx FIFO 0 Size. The Rx FIFO 0
                                                                                    elements are indexed from 0 to F0S-1.
                                                                                    0      No Rx FIFO 0   1-64  Number
                                                                                    of Rx FIFO 0 elements   >64   Values
                                                                                    greater than 64 are interpreted as 64
                                                                                    Qualified Write is possible only
                                                                                    with CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_RXF0C[F0WM] Bits */
#define MCAN_RXF0C_F0WM_OFS                      (24)                            /* !< F0WM Offset */
#define MCAN_RXF0C_F0WM_MASK                     ((uint32_t)0x7F000000U)         /* !< Rx FIFO 0 Watermark   0
                                                                                    Watermark interrupt disabled   1-64
                                                                                    Level for Rx FIFO 0 watermark
                                                                                    interrupt (IR.RF0W)   >64   Watermark
                                                                                    interrupt disabled   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */
/* MCAN_RXF0C[F0OM] Bits */
#define MCAN_RXF0C_F0OM_OFS                      (31)                            /* !< F0OM Offset */
#define MCAN_RXF0C_F0OM_MASK                     ((uint32_t)0x80000000U)         /* !< FIFO 0 Operation Mode. FIFO 0 can
                                                                                    be operated in blocking or in
                                                                                    overwrite mode.   0  FIFO 0 blocking
                                                                                    mode   1  FIFO 0 overwrite mode
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

