sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXBC Bits */
/* MCAN_TXBC[TBSA] Bits */
#define MCAN_TXBC_TBSA_OFS                       (2)                             /* !< TBSA Offset */
#define MCAN_TXBC_TBSA_MASK                      ((uint32_t)0x0000FFFCU)         /* !< Tx Buffers Start Address. Start
                                                                                    address of Tx Buffers section in
                                                                                    Message RAM (32-bit word address).
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_TXBC[NDTB] Bits */
#define MCAN_TXBC_NDTB_OFS                       (16)                            /* !< NDTB Offset */
#define MCAN_TXBC_NDTB_MASK                      ((uint32_t)0x003F0000U)         /* !< Number of Dedicated Transmit
                                                                                    Buffers   0      No Dedicated Tx
                                                                                    Buffers   1-32  Number of Dedicated
                                                                                    Tx Buffers   >32   Values greater
                                                                                    than 32 are interpreted as 32   Note:
                                                                                    Be aware that the sum of TFQS and
                                                                                    NDTB may be not greater than 32.
                                                                                    There is no check for erroneous
                                                                                    configurations. The Tx Buffers
                                                                                    section in the Message RAM starts
                                                                                    with the dedicated Tx Buffers.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_TXBC[TFQS] Bits */
#define MCAN_TXBC_TFQS_OFS                       (24)                            /* !< TFQS Offset */
#define MCAN_TXBC_TFQS_MASK                      ((uint32_t)0x3F000000U)         /* !< Transmit FIFO/Queue Size   0
                                                                                    No Tx FIFO/Queue   1-32  Number of Tx
                                                                                    Buffers used for Tx FIFO/Queue   >32
                                                                                    Values greater than 32 are
                                                                                    interpreted as 32   Note: Be aware
                                                                                    that the sum of TFQS and NDTB may be
                                                                                    not greater than 32. There is no
                                                                                    check for erroneous configurations.
                                                                                    The Tx Buffers section in the Message
                                                                                    RAM starts with the dedicated Tx
                                                                                    Buffers.   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_TXBC[TFQM] Bits */
#define MCAN_TXBC_TFQM_OFS                       (30)                            /* !< TFQM Offset */
#define MCAN_TXBC_TFQM_MASK                      ((uint32_t)0x40000000U)         /* !< Tx FIFO/Queue Mode   0  Tx FIFO
                                                                                    operation   1  Tx Queue operation
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

/* MCAN_TXFQS Bits */
/* MCAN_TXFQS[TFFL] Bits */
#define MCAN_TXFQS_TFFL_OFS                      (0)                             /* !< TFFL Offset */
#define MCAN_TXFQS_TFFL_MASK                     ((uint32_t)0x0000003FU)         /* !< Tx FIFO Free Level.  Number of
                                                                                    consecutive free Tx FIFO elements
                                                                                    starting from TFGI, range 0 to 32.
                                                                                    Read as zero when Tx Queue operation
                                                                                    is configured (TXBC.TFQM = '1'). */
/* MCAN_TXFQS[TFGI] Bits */
#define MCAN_TXFQS_TFGI_OFS                      (8)                             /* !< TFGI Offset */
#define MCAN_TXFQS_TFGI_MASK                     ((uint32_t)0x00001F00U)         /* !< Tx FIFO Get Index. Tx FIFO read
                                                                                    index pointer, range 0 to 31. Read as
                                                                                    zero when Tx Queue operation is
                                                                                    configured (TXBC.TFQM = '1').   Note:
                                                                                    In case of mixed configurations where
                                                                                    dedicated Tx Buffers are combined
                                                                                    with a Tx FIFO or a Tx Queue, the Put
                                                                                    and Get Indices indicate the number
                                                                                    of the Tx Buffer starting with the
                                                                                    first dedicated Tx Buffers. Example:
                                                                                    For a configuration of 12 dedicated
                                                                                    Tx Buffers and a Tx FIFO of 20
                                                                                    Buffers a Put Index of 15 points to
                                                                                    the fourth buffer of the Tx FIFO. */
/* MCAN_TXFQS[TFQP] Bits */
#define MCAN_TXFQS_TFQP_OFS                      (16)                            /* !< TFQP Offset */
#define MCAN_TXFQS_TFQP_MASK                     ((uint32_t)0x001F0000U)         /* !< Tx FIFO/Queue Put Index. Tx
                                                                                    FIFO/Queue write index pointer, range
                                                                                    0 to 31.   Note: In case of mixed
                                                                                    configurations where dedicated Tx
                                                                                    Buffers are combined with a Tx FIFO
                                                                                    or a Tx Queue, the Put and Get
                                                                                    Indices indicate the number of the Tx
                                                                                    Buffer starting with the first
                                                                                    dedicated Tx Buffers. Example: For a
                                                                                    configuration of 12 dedicated Tx
                                                                                    Buffers and a Tx FIFO of 20 Buffers a
                                                                                    Put Index of 15 points to the fourth
                                                                                    buffer of the Tx FIFO. */
/* MCAN_TXFQS[TFQF] Bits */
#define MCAN_TXFQS_TFQF_OFS                      (21)                            /* !< TFQF Offset */
#define MCAN_TXFQS_TFQF_MASK                     ((uint32_t)0x00200000U)         /* !< Tx FIFO/Queue Full   0  Tx
                                                                                    FIFO/Queue not full   1  Tx
                                                                                    FIFO/Queue full */

/* MCAN_TXESC Bits */
/* MCAN_TXESC[TBDS] Bits */
#define MCAN_TXESC_TBDS_OFS                      (0)                             /* !< TBDS Offset */
#define MCAN_TXESC_TBDS_MASK                     ((uint32_t)0x00000007U)         /* !< Tx Buffer Data Field Size   000  8
                                                                                    byte data field   001  12 byte data
                                                                                    field   010  16 byte data field   011
                                                                                    20 byte data field   100  24 byte
                                                                                    data field   101  32 byte data field
                                                                                    110  48 byte data field   111  64
                                                                                    byte data field   Note: In case the
                                                                                    data length code DLC of a Tx Buffer
                                                                                    element is configured to a value
                                                                                    higher than the Tx Buffer data field
                                                                                    size TXESC.TBDS, the bytes not
                                                                                    defined by the Tx Buffer are
                                                                                    transmitted as "0xCC" (padding
                                                                                    bytes).   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */

